/*
Navicat MySQL Data Transfer

Source Server         : localhost
Source Server Version : 50716
Source Host           : localhost:3306
Source Database       : giftube

Target Server Type    : MYSQL
Target Server Version : 50716
File Encoding         : 65001

Date: 2017-11-02 17:02:25
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Records of categories
-- ----------------------------
INSERT INTO `categories` VALUES ('4', 'Видеоигры'), ('2', 'Животные'), ('8', 'Люди'), ('6', 'Наука'), ('5', 'Приколы'), ('3', 'Спорт'), ('7', 'Фейлы'), ('1', 'Фильмы и анимация');

-- ----------------------------
-- Records of comments
-- ----------------------------

-- ----------------------------
-- Records of gifs
-- ----------------------------
INSERT INTO `gifs` VALUES ('2', '5', '1', '2017-03-29 16:00:58', '656', '1', '0', 'Конец рабочего дня', 'Когда хорошо поработал', 'gif58dbda3a4313d.gif'), ('3', '2', '1', '2017-03-29 16:15:43', '781', '1', '2', 'Учим новичка решать задачи', 'Тяжело в учении, легко в бою', 'gif58dbddaf5ce7e.gif'), ('4', '8', '1', '2017-03-29 16:19:13', '801', '0', '1', 'Когда любишь порядок', 'Все вещи должны быть на своем месте', 'gif58dbde81b4a8b.gif'), ('5', '8', '1', '2017-03-29 16:22:10', '669', '1', '0', 'Премии на моей бывшей работе', 'Горькая правда', 'gif58dbdf3251fcf.gif'), ('6', '8', '1', '2017-03-29 16:24:32', '327', '1', '1', 'Отличные витаминки', 'Бодрят не по детски', 'gif58dbdfc01c1a4.gif'), ('7', '7', '1', '2017-03-29 16:25:53', '360', '0', '0', 'Командная работа', 'Когда попросил коллег помочь исправить баг', 'gif58dbe01159218.gif'), ('8', '7', '1', '2017-03-29 16:28:19', '285', '0', '0', 'Рыбак', 'Новая техника рыбалки', 'gif58dbe0a3bef37.gif'), ('9', '1', '1', '2017-03-29 16:32:56', '343', '0', '0', 'Восторг', 'Когда видишь своего кумира', 'gif58dbe1b8426e5.gif'), ('10', '2', '1', '2017-03-29 16:35:28', '446', '0', '0', 'Доминирование', 'Когда показываешь новичку как ты используешь любимый фреймворк', 'gif58dbe2501a265.gif'), ('11', '4', '1', '2017-03-29 16:37:21', '1395', '3', '4', 'Unstoppable', 'Мастер дигла 80 лвл', 'gif58dbe2c14330a.gif'), ('12', '2', '1', '2017-03-29 16:38:21', '1021', '1', '2', 'Типичный юзер', 'В интернете никто не знает что ты - кот', 'gif58dbe2fd97ceb.gif');

-- ----------------------------
-- Records of gifs_fav
-- ----------------------------

-- ----------------------------
-- Records of gifs_like
-- ----------------------------

-- ----------------------------
-- Records of users
-- ----------------------------
INSERT INTO `users` VALUES ('1', '2017-03-29 15:56:39', 'sks89@mail.ru', 'frexin', '$2y$10$ZjU6ojx3fZmM84Ztzpoj../40Eu72X/ZGbt/ofN/5Eujriw1M6vwO', 'avatar58dbd9371dab6.png', '9e5914a3afc60dc557b15b6dd10cc45b');
SET FOREIGN_KEY_CHECKS=1;
